#1) Даны два словаря: dictionary_1 = {'a': 300, 'b': 400} и dictionary_2 = {'c': 500, 'd': 600}. Объедините их в один при помощи встроенных функций языка Python. Результаты выведите на экран.
#2) Дан словарь с числовыми значениями. Необходимо их все перемножить и вывести на экран. Результаты выведите на экран.
#3) Создайте словарь, в котором ключами будут числа от 1 до 10, а значениями эти же числа, возведенные в куб. Результаты выведите на экран.
#4) Даны два списка одинаковой длины. Необходимо создать из них словарь таким образом, чтобы элементы первого списка были ключами, а элементы второго — соответственно значениями нашего словаря. Результаты выведите на экран.
